***MEKELLE UNIVERSITY***

***MEKELLE INSTITUTE OF TECHNOLOGY***

*DATABASE LAB-2 ASSIGNMENT*

***<u>NAME</u> <u>ID</u>***

1.  ***Samuel Kiros MIT/UR190616/16***

2.  ***Saymon Gebreamlak MIT/UR190620/16***

3.  ***Gebretsadik Mehari MIT/UR 190722/16***

4.  ***Kahsay Halefom MIT/UR190737/16***

5.  ***Samuel Kahsay***

<!-- -->


1.  Retrieve all students taught by Prof. Alemu.

SELECT DISTINCT s.student_id, s.student_name, s.student_email  
FROM Student s  
JOIN Teacher t ON s.dept_id = t.dept_id  
WHERE t.teacher_name = 'Prof. Alemu';


2.  List all courses offered by the IT department and their respective
    teachers.

SELECT C.course_name, T.teacher_name

FROM Course C

JOIN Department D ON C.dept_id = D.dept_id

JOIN Teacher T ON C.teacher_id = T.teacher_id

WHERE D.dept_name = 'IT';


3.  find all students in the CS department who are enrolled in the
    ‘Fall’ semester.

SELECT DISTINCT S.student_name

FROM Student S

JOIN Department D ON S.dept_id = D.dept_id

JOIN Enrollment E ON S.student_id = E.student_id

WHERE D.dept_name = 'CS' AND E.semester = 'Fall';


4.  Display all teachers and the number of courses they teach.

SELECT T.teacher_name, COUNT(C.course_id) AS NumberOfCourses

FROM Teacher T

LEFT JOIN Course C ON T.teacher_id = C.teacher_id

GROUP BY T.teacher_id, T.teacher_name

ORDER BY T.teacher_name;


5.  List the department with the highest number of students.

SELECT D.dept_name, COUNT(S.student_id) AS NumberOfStudents

FROM Department D

JOIN Student S ON D.dept_id = S.dept_id

GROUP BY D.dept_id, D.dept_name

ORDER BY NumberOfStudents DESC

LIMIT 1;